case/Stefen_Problem_Verification/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
 (0 0 -2)    //0
 (100 0 -2)   //1
 (100 15 -2)  //2
 (0 15 -2)   //3
 (0 0 2) //4
 (100 0 2)  //5
 (100 15 2) //6
 (0 15 2) //7
 );



blocks          
(
 hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
 );

boundary
(
    upperWall 
    {
      type wall;
      faces
      (
       (3 2 6 7)
      );
    }
	lowerWall 
    {
      type wall;
      faces
      (
       (0 1 5 4)
      );
    }
	oWall 
    {
      type wall;
      faces
      (
       (1 5 6 2)
      );
    }
	axis
	{
	  type wall;
	  faces
	  (
	   (0 3 7 4)
	  );
	}
	front
	{
	  type empty;
	  faces
	  (
	   (0 1 2 3)
	  );
	}
	Back
	{
	  type empty;
	  faces
	  (
	   (4 5 6 7)
	  );
	}
)

mergePatchPairs 
(
 );

// ************************************************************************* //
