case/Stefen_Problem_Verification/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 268;

boundaryField
{
    upperWall
    {
	    type	    	zeroGradient;
    }
    axis
    {
		type            fixedValue;
		value           uniform 268;
    }
    lowerWall
    {
        type	    	zeroGradient;
    }
    oWall
    {
		type            fixedValue;
		value           uniform 278;
    }
    front
    {
        type            empty;
    }	
	Back
    {
        type            empty;
    }
}


// ************************************************************************* //
