case/Stefen_Problem_Verification/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (T);
probeLocations
(
    (0.001 0.00375 0)
    (0.0015 0.00375 0)
	(0.0016 0.00375 0)
	(0.0017 0.00375 0)
	(0.0018 0.00375 0)
	(0.0019 0.00375 0)
	(0.002 0.00375 0)
	(0.003 0.00375 0)
	(0.004 0.00375 0)
	(0.005 0.00375 0)
	(0.006 0.00375 0)
	(0.007 0.00375 0)
	(0.008 0.00375 0)
	(0.009 0.00375 0)
	(0.010 0.00375 0)
	(0.011 0.00375 0)
	(0.012 0.00375 0)
	(0.013 0.00375 0)
	(0.014 0.00375 0)

    (0.001 0.0075 0)
    (0.0015 0.0075 0)
	(0.0016 0.0075 0)
	(0.0017 0.0075 0)
	(0.0018 0.0075 0)
	(0.0019 0.0075 0)	
	(0.002 0.0075 0)
	(0.003 0.0075 0)
	(0.004 0.0075 0)
	(0.005 0.0075 0)
	(0.006 0.0075 0)
	(0.007 0.0075 0)
	(0.008 0.0075 0)
	(0.009 0.0075 0)
	(0.010 0.0075 0)
	(0.011 0.0075 0)
	(0.012 0.0075 0)
	(0.013 0.0075 0)
	(0.014 0.0075 0)
	
	(0.001 0.01125 0)
	(0.0015 0.01125 0)
	(0.0016 0.01125 0)
	(0.0017 0.01125 0)
	(0.0018 0.01125 0)
	(0.0019 0.01125 0)
	(0.002 0.01125 0)
	(0.003 0.01125 0)
	(0.004 0.01125 0)
	(0.005 0.01125 0)
	(0.006 0.01125 0)
	(0.007 0.01125 0)
	(0.008 0.01125 0)
	(0.009 0.01125 0)
	(0.010 0.01125 0)
	(0.011 0.01125 0)
	(0.012 0.01125 0)
	(0.013 0.01125 0)
	(0.014 0.01125 0)
);

// ************************************************************************* //
