case/Stefen_Problem_Verification/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
	name	porousWalls;
    type	cellSet;//faceSet;
	action	new;
	source  boxToCell;
	sourceInfo
	{
	   box (0 0 -100) (100 100 100); 
	}
    } 
   //faceZone:leftAndRightWall
   {
	name	porosz;
	type	cellZoneSet;//faceZoneSet;
	action	new;
 	source  setToCellZone;
	sourceInfo
	{	
	   //faceSet	  porousWalls;
	   set	  porousWalls;
	}
   } 

    
);



// ************************************************************************* //
